from asm2 import Memory, Processor

memory = Memory(512)
memory.write_code("""ЦЕЛ Д, 7
ЦЕЛ Б, 0
ЦЕЛ Г, 0
цикл1:
ИНК Б
ЦЕЛ А, 8
ВЫЧ А, Б
КОП ПАМ, А
цикл2:                  ; выводим пробел i-7 раз
ЗВОНИ :пробел
ДЕК ПАМ
ПРЫГНЕZ :цикл2
КОП ПАМ, Б
СЛОЖ ПАМ, ПАМ
ДЕК ПАМ
цикл3:                  ; выводим звездочку i*2-1 раз
ЗВОНИ :звездочка
ДЕК ПАМ
ПРЫГНЕZ :цикл3
ЗВОНИ :пропуск
СРАВ Б, Д
ПРЫГZ :цикл1
СТОП
пробел:                     ; вывели пробел
ЦЕЛ А, 32
ВЫВ А
НАЗАД
звездочка:                  ; вывели звездочку
ЦЕЛ А, 42
ВЫВ А
НАЗАД
пропуск:                    ; вывели пропуск
ЦЕЛ А, 10
ВЫВ А
НАЗАД""")
processor = Processor(memory)
processor.live()
